---
kind: method
id: M:Autodesk.Revit.DB.PhaseArray.#ctor
source: html/d4e82096-9a8b-9f1f-463b-6173b7258845.htm
---
# Autodesk.Revit.DB.PhaseArray.#ctor Method

Initializes a new instance of the PhaseArray class

## Syntax (C#)
```csharp
public PhaseArray()
```